SamuelCicuitStudio/ESP32s3-USB-COMPOSITE-MSC-CDC/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=n
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000
# USB
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=256
CONFIG_TINYUSB_CDC_TX_BUFSIZE=256
CONFIG_TINYUSB_MSC_BUFSIZE=512
